src/Services/Air/templates/AIR_TICKET_REQUEST.xml

<!--Release 8.1--><!--Version Dated as of 15/Apr/2015 11:24:08-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <air:AirTicketingReq
            AuthorizedBy="user" ReturnInfoOnFail="true" TargetBranch="{{TargetBranch}}"
            xmlns:air="http://www.travelport.com/schema/air_v33_0"
            xmlns:com="http://www.travelport.com/schema/common_v36_0"
            >
            <com:BillingPointOfSaleInfo OriginApplication="uAPI" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
            <air:AirReservationLocatorCode>{{ReservationLocator}}</air:AirReservationLocatorCode>
            {{#refs}}
            <air:AirPricingInfoRef Key="{{key}}"/>
            {{/refs}}
            <air:AirTicketingModifiers>
                {{#if commission}}
                <com:Commission Level="Fare" xmlns:com="http://www.travelport.com/schema/common_v33_0"
                    {{#if commission.percent}}
                        Type="PercentBase" Percentage="{{commission.percent}}"
                    {{else}}
                        Type="Flat" Amount="{{commission.amount}}"
                    {{/if}}
                />
                {{/if}}
                <com:FormOfPayment xmlns:com="http://www.travelport.com/schema/common_v33_0" Type="{{fop.type}}" />
                <!--<com:FormOfPayment>-->
            </air:AirTicketingModifiers>
            {{#if emulatePcc}}
            <com:OverridePCC ProviderCode="1G" PseudoCityCode="{{emulatePcc}}"/>
            {{/if}}
        </air:AirTicketingReq>
    </soap:Body>
</soap:Envelope>
